snlkuharlocal/src/AccumulationRegisters/ОстаткиПлановПродаж/ОстаткиПлановПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиПлановПродаж</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПланаПродаж</name>
    <type>
      <types>CatalogRef.ВидыПланаПродаж</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/InformationRegisters/Распределение/Распределение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Распределение</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Процент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/РаспределениеПлановПродажПоНакладным/РаспределениеПлановПродажПоНакладным.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаспределениеПлановПродажПоНакладным</name>
  <dimensions>
    <name>ПланПродаж</name>
    <type>
      <types>DocumentRef.ПланПродаж</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Documents/ПланПродаж/ПланПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланПродаж</name>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <registerRecords>AccumulationRegister.ПланПродаж</registerRecords>
  <registerRecords>AccumulationRegister.ПланПродажШтуки</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиПлановПродаж</registerRecords>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТовара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Брэнд</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Детальный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Утвержден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Акция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентИзмененияКоличества</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРасчетаЦенПоМатрице</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеУчитыватьПриРасчетеЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПланаПродаж</name>
    <type>
      <types>CatalogRef.ВидыПланаПродаж</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦеныРассчитаны</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>ТипТовара</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Брэнд</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТоварныйЗапас</name>
      <comment>Товарный запас в днях торговли</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоБезСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БазовоеКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКомплектующих</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатрицыДляРасчетаЦен</name>
    <attributes>
      <name>Матрица</name>
      <type>
        <types>DocumentRef.Матрица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/ОстаткиПлановПродаж/ManagerModule.bsl
Процедура СформироватьИЗаписатьДвижения (РегистраторОбъект) Экспорт       
	 
		РегистраторСсылка = РегистраторОбъект.Ссылка;
	  	ТекстЗапроса = ПолучитьТекстЗапросаТаблицыДвижения(РегистраторСсылка);
	    ТаблицаДвижений = ПолучитьТаблицуДвижений(ТекстЗапроса, РегистраторСсылка);
		ЗаписатьДвиженияОтстатковПлана(ТаблицаДвижений, РегистраторОбъект);
	   
КонецПроцедуры

Функция ПолучитьТекстЗапросаТаблицыДвижения (Знач Регистратор) Экспорт  
	
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.ПланПродаж") Тогда  	 
		ТекстЗапроса = ПолучитьТекстЗапросаПоПлануПродаж(Регистратор); 
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда  
		 ТекстЗапроса = ПолучитьТекстЗапросаПоРасходнойНакладной(); 
	КонецЕсли;	
	
	Возврат ТекстЗапроса;	
	
КонецФункции    


Функция ПолучитьТекстЗапросаПоРасходнойНакладной ()     
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(РасходнаяНакладнаяТовары.Заявка - РасходнаяНакладнаяТовары.Количество) КАК Количество
	               |ИЗ
	               |	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	               |ГДЕ
	               |	РасходнаяНакладнаяТовары.Ссылка = &Ссылка
	               |	И РасходнаяНакладнаяТовары.Заявка > РасходнаяНакладнаяТовары.Количество
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасходнаяНакладнаяТовары.Номенклатура";
	
	Возврат ТекстЗапроса; 
	
КонецФункции                



Функция ПолучитьТекстЗапросаПоПлануПродаж (Знач Регистратор)     
	
	Детальный = ПолучитьРеквизитШапки(Регистратор, "Детальный", "Документ");
	Если Детальный Тогда 
		ТекстЗапроса = 	"ВЫБРАТЬ
		|	ПланПродаж.Номенклатура КАК Номенклатура,
		|	СУММА(ПланПродаж.КоличествоОстаток) КАК Количество
		|ИЗ
		|	Документ.ПланПродаж.Состав КАК ПланПродаж
		|ГДЕ
		|	ПланПродаж.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПланПродаж.Номенклатура";
	Иначе   		
		ТекстЗапроса = "ВЫБРАТЬ
		|	РаспределениеСрезПоследних.Номенклатура КАК Номенклатура,
		|	СУММА(ПланПродаж.КоличествоОстаток * ЕСТЬNULL(РаспределениеСрезПоследних.Процент/100, 0)) КАК Количество
		|ИЗ
		|	Документ.ПланПродаж.Состав КАК ПланПродаж
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Распределение.СрезПоследних(&Дата, Склад = &Склад) КАК РаспределениеСрезПоследних
		|		ПО ПланПродаж.Модель = РаспределениеСрезПоследних.Номенклатура.Родитель
		|ГДЕ
		|	ПланПродаж.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РаспределениеСрезПоследних.Номенклатура";	
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции                

Функция СформироватьПустуюТаблицуДвижений ()   
	
	ТаблицаДвижений = новый ТаблицаЗначений;      
	ТаблицаДвижений.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДвижений.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТаблицаДвижений.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));	
	ТаблицаДвижений.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));	
	ТаблицаДвижений.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));	
	ТаблицаДвижений.Колонки.Добавить("ВидПланаПродаж", Новый ОписаниеТипов("СправочникСсылка.ВидыПланаПродаж"));	
	ТаблицаДвижений.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	
	Возврат ТаблицаДвижений;
	
КонецФункции

Функция ПолучитьТаблицуДвижений (Знач ТекстЗапроса, Знач Регистратор) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;  
	Запрос.УстановитьПараметр("Ссылка", Регистратор);   
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.ПланПродаж") Тогда  	
		РеквизитыШапки = ПолучитьРеквизитыШапки(Регистратор, "Дата, Склад, ВидПланаПродаж, Контрагент, Подразделение", "Документ");
		Запрос.УстановитьПараметр("Дата", КонецДня(РеквизитыШапки.Дата));
		Запрос.УстановитьПараметр("Склад", РеквизитыШапки.Склад);     
		Период = КонецМесяца(РеквизитыШапки.Дата);  
	Иначе               		
		РеквизитыШапкиНакладной = ПолучитьРеквизитыШапки(Регистратор, "Дата", "Документ");  
		ОбразецПлана = РегистрыСведений.РаспределениеПлановПродажПоНакладным.ПолучитьОбразецПланаПоНакладной(Регистратор);        
		Если ОбразецПлана <> Неопределено Тогда  
			РеквизитыШапки = ПолучитьРеквизитыШапки(ОбразецПлана,"Склад, ВидПланаПродаж, Контрагент, Подразделение", "Документ"); 	
			РеквизитыШапки.Вставить("Дата", РеквизитыШапкиНакладной.Дата)
		Иначе   
			ВызватьИсключение СтрШаблон("При расчёте проводок по остаткам планов документа %1, не обнаружена связка с планами продаж.", Регистратор);
		КонецЕсли;    
		Период = РеквизитыШапки.Дата;   
	КонецЕсли;                         
	
	Выборка = Запрос.Выполнить().Выбрать();   
	
	ТаблицаДвижений = СформироватьПустуюТаблицуДвижений();
	
	
	Пока Выборка.Следующий() Цикл    
		
		Если Выборка.Количество = 0 Тогда 
			Продолжить;
		КонецЕсли;           
		СтрокаТаблицы = ТаблицаДвижений.Добавить();   
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, РеквизитыШапки);
  		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);

		СтрокаТаблицы.Период			= Период;
 		
	КонецЦикла;
	
	Возврат ТаблицаДвижений;
	
КонецФункции

Процедура ЗаписатьДвиженияОтстатковПлана (ТаблицаДвижений, РегистраторОбъект)   
	
	Для Каждого СтрокаТаблицы Из ТаблицаДвижений Цикл   
		Движение = РегистраторОбъект.Движения.ОстаткиПлановПродаж.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, СтрокаТаблицы);	
	КонецЦикла;       

КонецПроцедуры
